{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "afraid",
    "1": "angry",
    "2": "anxious",
    "3": "calm",
    "4": "confused",
    "5": "disgusted",
    "6": "excited",
    "7": "frustrated",
    "8": "happy",
    "9": "proud",
    "10": "sad",
    "11": "satisfied",
    "12": "surprised"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "afraid": 0,
    "angry": 1,
    "anxious": 2,
    "calm": 3,
    "confused": 4,
    "disgusted": 5,
    "excited": 6,
    "frustrated": 7,
    "happy": 8,
    "proud": 9,
    "sad": 10,
    "satisfied": 11,
    "surprised": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.46.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
