{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "exercise",
    "1": "family",
    "2": "food",
    "3": "friends",
    "4": "god",
    "5": "health",
    "6": "love",
    "7": "recreation",
    "8": "school",
    "9": "sleep",
    "10": "work"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "exercise": 0,
    "family": 1,
    "food": 2,
    "friends": 3,
    "god": 4,
    "health": 5,
    "love": 6,
    "recreation": 7,
    "school": 8,
    "sleep": 9,
    "work": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.46.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
